packages/fxa-auth-server/test/local/payments/fixtures/stripe/invoice_open.json

{
  "id": "in_1EPZyNJNcmPzuWtRupNF0Dn7",
  "object": "invoice",
  "account_country": "US",
  "account_name": "Mozilla Corporation",
  "amount_due": 1000,
  "amount_paid": 1000,
  "amount_remaining": 0,
  "application_fee_amount": null,
  "attempt_count": 1,
  "attempted": true,
  "auto_advance": false,
  "billing_reason": "subscription_create",
  "collection_method": "charge_automatically",
  "created": 1555354567,
  "currency": "usd",
  "custom_fields": null,
  "customer": "cus_GfXygqAm7FslSC",
  "customer_address": null,
  "customer_email": "test_fixture@tester.com",
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "hosted_invoice_url": "https://pay.stripe.com/invoice/invst_ZPQW1BXsP9LEjkKf4oXxhNMeeS",
  "invoice_pdf": "https://pay.stripe.com/invoice/invst_ZPQW1BXsP9LEjkKf4oXxhNMeeS/pdf",
  "lines": {
    "data": [
      {
        "id": "il_tmp_8c67c5521c9c3d",
        "object": "line_item",
        "amount": 499,
        "currency": "usd",
        "description": "1 \u00d7 Firefox Private Network (at $4.99 / month)",
        "discountable": true,
        "livemode": false,
        "metadata": {},
        "period": {
          "end": 1584220861,
          "start": 1581715261
        },
        "quantity": 1,
        "tax_rates": [],
        "pricing": {
          "price_details": {
            "price": "plan_FxFGE9jvhYvCMe",
            "product": "prod_GvH2k78kKusAlV"
          },
          "type": "price_details",
          "unit_amount_decimal": "499"
        },
        "parent": {
          "type": "subscription_item_details",
          "subscription_item_details": {
            "subscription": "sub_GY2uVWIDdywa3l",
            "subscription_item": "si_GY2u5UxXBWUS22",
            "proration": false,
            "proration_details": null
          },
          "invoice_item_details": null
        },
        "taxes": []
      }
    ],
    "has_more": false,
    "object": "list",
    "url": "/v1/invoices/in_1EPZyNJNcmPzuWtRupNF0Dn7/lines"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": null,
  "number": "3B74E3D0-0001",
  "period_end": 1555354567,
  "period_start": 1555354567,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "receipt_number": "2800-4263",
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "open",
  "status_transitions": {
    "finalized_at": 1555354567,
    "marked_uncollectible_at": null,
    "paid_at": 1555354568,
    "voided_at": null
  },
  "subtotal": 1000,
  "tax_percent": null,
  "total": 1000,
  "webhooks_delivered_at": 1555354569,
  "parent": {
    "type": "subscription_details",
    "subscription_details": {
      "subscription": "sub_EtMh0Ty6MEtjdv"
    }
  },
  "payments": {
    "object": "list",
    "data": [
      {
        "payment": {
          "payment_intent": "pi_1EPZyNJNcmPzuWtR9U3SsJ4w",
          "charge": "ch_1EPZyOJNcmPzuWtRKcc9Fyos"
        },
        "status": "open"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": ""
  },
  "discounts": [],
  "total_taxes": []
}
